[
{
    "eventName": "Infinity Hunt",
    "eventDescription":
      "Infinity Hunt is a thrilling treasure hunt-style event that combines the excitement of discovery with the challenge of mental acuity. The event features a unique combination of aptitude questions, coding challenges, and engaging puzzles. Participants will solve clues, crack codes, and race against time to reach the final destination.",
    "hostDepartment": "CSE",
    "eventDay": "day1 or day2",
    "startTime": "9:30 AM",
    "endTime": "3:00 PM",
    "venue": "New Building Labs",
    "eligibleParticipants": "Any students from engineering branch",
    "singleEntryFee": "100",
    "groupEntryFee": "400",
    "registrationFormLink": "",
    "qrLink": "",
    "prizeMoney": {
      "first": "3000",
      "second": "2000",
      "third": "1000"
    },
    "rulesAndRegulations": [
      {
        "title": "Mandatory Attendance",
        "description":
          "All participants must report on time and attend the entire event from start to end (9:30 AM to 3:30 PM). Late entries or early exits may lead to disqualification."
      },
      {
        "title": "Group Participation Etiquette",
        "description":
          "Groups must stay together during the hunt. Splitting up to solve clues individually is not allowed and will result in penalty points."
      },
      {
        "title": "Respect for Venue",
        "description":
          "Participants must not damage property or tamper with equipment in labs, cabins, or buildings. Any such behavior will lead to immediate disqualification."
      },
      {
        "title": "No External Help",
        "description":
          "The use of mobile phones, the internet, or assistance from outsiders is strictly prohibited unless specified in a challenge. All answers must be solved independently by the team."
      },
      {
        "title": "Clue Integrity",
        "description":
          "Do not remove, hide, or alter any clues once found. If you find a clue meant for another team, report it to the coordinators."
      }
    ],
    "eventRounds": [
      {
        "title": "Round 1 – Aptitude Clash",
        "description":
          "Participants will face logic-based aptitude and reasoning questions. Top scorers will move to the next round."
      },
      {
        "title": "Round 2 – Code Crypt",
        "description":
          "A coding challenge where participants solve puzzles or decode logic to find clues."
      },
      {
        "title": "Final Round – The Hunt",
        "description":
          "The ultimate treasure hunt round across the venue, filled with hidden clues, riddles, and tech puzzles."
      }
    ],
    "others": {
      "warnings": [
        "Carry your college ID cards.",
        "Wear comfortable shoes for movement.",
        "Be ready for outdoor and indoor challenges."
      ],
      "images": [
        "/images/hunt-map.jpg",
        "/images/hint-preview.png"
      ],
      "map": "/maps/infinity-hunt-map.pdf"
    },
    "sponsors": [
      {
        "name": "TechNova Inc.",
        "logo": "/sponsors/technova.png"
      },
      {
        "name": "CodeSphere",
        "logo": "/sponsors/codesphere.png"
      }
    ]
  }
]